/* Used when showing an invalid entry or input encountered when expecting a formal entry such as a number of date */
"\\U201c%@\\U201d" = "“%@”";

/* NSKeyValueValidationError, message shown when the numeric value of user input is invalid (for example too small or too large) */
"Err1024-C" = "O valor não é válido.";

/* NSKeyValueValidationError, message shown when the numeric value of user input is invalid (for example too small or too large) */
"Err1024-C.a" = "O valor %@ não é válido.";

/* NSKeyValueValidationError, suggestion string when a numeric value of an user input is invalid (for example too small or too large) */
"Err1024-R" = "Digite um valor válido.";

/* NSFormattingError, message shown when the numeric value of an entry or input is invalid (for example too small or too large) */
"Err2048-C" = "O valor não é válido.";

/* NSFormattingError, message shown when the numeric value of an entry or input is invalid (for example too small or too large) */
"Err2048-C.a" = "O valor %@ não é válido.";

/* NSFormattingError, message shown when the numeric value of an entry or input is too small */
"Err2048-C.an" = "O valor é demasiado pequeno.";

/* NSFormattingError, message shown when the numeric value of an entry or input is too large */
"Err2048-C.ax" = "O valor é demasiado grande.";

/* NSFormattingError, suggestion string when a numeric value of an entry or input is invalid (for example too small or too large) */
"Err2048-R" = "Digite um valor válido.";

/* NSFormattingError, suggestion string when a numeric value of an entry or input is too small */
"Err2048-R.n" = "Digite um número superior ou igual a %@.";

/* NSFormattingError, suggestion string when a numeric value of an entry or input is too small or too large */
"Err2048-R.nx" = "Digite um número de %1$@ a %2$@.";

/* NSFormattingError, suggestion string when a numeric value of an entry or input is too large */
"Err2048-R.x" = "Digite um número inferior ou igual a %@.";

/* NSFormattingError, message shown when the numeric value of an entry or input is invalid (for example too small or too large) */
"Err2048.an" = "O valor %@ é demasiado pequeno.";

/* NSFormattingError, message shown when the numeric value of an entry or input is invalid (for example too small or too large) */
"Err2048.ax" = "O valor %@ é demasiado grande.";

/* NSFileLockingError */
"Err255-C" = "Não foi possível proteger o ficheiro.";

/* NSFileLockingError */
"Err255-R" = "É possível que o ficheiro já esteja protegido, ou pode não ter autorização para o proteger.";

/* NSFileLockingError, argument is a file name */
"Err255.f" = "Não foi possível proteger o ficheiro “%@”.";

/* NSFileReadUnknownError */
"Err256" = "Não foi possível abrir o ficheiro.";

/* NSFileReadUnknownError, argument is a file name */
"Err256.f" = "Não foi possível abrir o ficheiro “%@”.";

/* NSFileReadNoPermissionError */
"Err257" = "Não foi possível abrir o ficheiro, porque não tem autorização para o ver.";

/* NSFileReadNoPermissionError */
"Err257-C" = "Não tem permissão.";

/* NSFileReadNoPermissionError; ; suggestion applies to files or folders, hence the use of the word item */
"Err257-R" = "Para ver ou alterar permissões, seleccione o elemento no Finder e escolha Ficheiro > Informações.";

/* NSFileReadNoPermissionError, argument is a file name */
"Err257.f" = "Não foi possível abrir o ficheiro “%@”, porque não tem autorização para o ver.";

/* NSFileReadInvalidFileNameError */
"Err258-C" = "O nome de ficheiro não é válido.";

/* NSFileReadInvalidFileNameError, argument is a file or folder name */
"Err258.f" = "Não foi possível abrir o elemento, porque o nome de ficheiro “%@” não é válido.";

/* NSFileReadCorruptFileError */
"Err259" = "Não foi possível abrir o ficheiro, porque o respectivo formato não é correcto.";

/* NSFileReadCorruptFileError */
"Err259-C" = "O formato do ficheiro não é o correcto.";

/* NSFileReadCorruptFileError */
"Err259-R" = "É possível que o ficheiro esteja danificado, truncado ou num formato diferente do esperado.";

/* NSFileReadCorruptFileError, argument is a file name */
"Err259.f" = "Não foi possível abrir o ficheiro “%@”, porque o respectivo formato não é correcto.";

/* NSFileReadNoSuchFileError */
"Err260" = "Não foi possível abrir o ficheiro porque não existe.";

/* NSFileReadNoSuchFileError */
"Err260(Folder).f" = "A pasta “%@” não existe.";

/* NSFileReadNoSuchFileError */
"Err260-C" = "O ficheiro não existe.";

/* NSFileReadNoSuchFileError */
"Err260-C(Folder)" = "A pasta não existe.";

/* NSFileReadNoSuchFileError, argument is a file name */
"Err260.f" = "Não foi possível abrir o ficheiro “%@”, porque este não existe.";

/* NSFileReadInapplicableStringEncodingError */
"Err261" = "Não foi possível abrir o ficheiro com a codificação de texto especificada.";

/* NSFileReadInapplicableStringEncodingError */
"Err261-C" = "A codificação de texto especificada não é aplicável.";

/* NSFileReadInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err261-C.e" = "A codificação de texto %@ não é aplicável.";

/* NSFileReadInapplicableStringEncodingError */
"Err261-R" = "Pode ser que o ficheiro tenha sido guardado com uma codificação de texto diferente ou que não seja um ficheiro de texto.";

/* NSFileReadInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err261.e" = "Não foi possível abrir o ficheiro com a codificação de texto %@.";

/* NSFileReadInapplicableStringEncodingError, arguments are file name and text encoding name (for instance 'Western (Mac OS Roman)' */
"Err261.ef" = "Não foi possível abrir o ficheiro “%2$@” com a codificação de texto %1$@.";

/* NSFileReadUnsupportedSchemeError */
"Err262" = "Não foi possível abrir o ficheiro, porque o tipo de URL especificado não é suportado.";

/* NSFileReadUnsupportedSchemeError */
"Err262-C" = "O tipo de URL especificado não é suportado.";

/* NSFileReadUnsupportedSchemeError, arguments are file name and URL scheme name (for instance ftp:) */
"Err262.fu" = "Não foi possível abrir o ficheiro “%1$@”, porque o tipo de URL %2$@ não é suportado.";

/* NSFileReadUnsupportedSchemeError, argument is URL scheme name (for instance ftp:) */
"Err262.u" = "Não foi possível abrir o ficheiro, porque o tipo de URL %@ não é suportado.";

/* NSFileReadTooLargeError */
"Err263" = "Não foi possível abrir o ficheiro, porque é demasiado grande.";

/* NSFileReadTooLargeError, reason string */
"Err263-C" = "O ficheiro é demasiado grande.";

/* NSFileReadTooLargeError, argument is a file name */
"Err263.f" = "Não foi possível abrir o ficheiro “%@” por ser demasiado grande.";

/* NSFileReadUnknownStringEncodingError */
"Err264" = "Não foi possível abrir o ficheiro, porque a codificação de texto do conteúdo não foi estabelecida.";

/* NSFileReadUnknownStringEncodingError, reason string */
"Err264-C" = "Não foi possível determinar a codificação de texto do conteúdo.";

/* NSFileReadUnknownStringEncodingError, recovery suggestion */
"Err264-R" = "Se especificar uma codificação de texto, talvez consiga abrir o ficheiro.";

/* NSFileReadUnknownStringEncodingError, argument is a file name */
"Err264.f" = "Não foi possível abrir o ficheiro “%@”, porque a codificação de texto do conteúdo não foi estabelecida.";

/* NSUserCancelledError */
"Err3072-C" = "A operação foi cancelada.";

/* NSPropertyListCorruptError */
"Err3840" = "Não foi possível ler os dados, porque estão corrompidos.";

/* NSPropertyListCorruptError */
"Err3840-C" = "Os dados estão corrompidos.";

/* NSPropertyListUnknownVersionError */
"Err3841" = "Não foi possível ler os dados, porque estão num formato não suportado por esta aplicação.";

/* NSPropertyListUnknownVersionError */
"Err3841-C" = "Os dados estão num formato não suportado por esta aplicação.";

/* NSPropertyListReadStreamError */
"Err3842" = "Não foi possível ler os dados, porque ocorreu um erro na origem dos dados.";

/* NSPropertyListReadStreamError */
"Err3842-C" = "Ocorreu um erro na origem dos dados.";

/* NSPropertyListWriteStreamError */
"Err3851" = "Não foi possível escrever os dados, porque ocorreu um erro no destino dos dados.";

/* NSPropertyListWriteStreamError */
"Err3851-C" = "Ocorreu um erro no destino dos dados.";

/* NSFileNoSuchFileError, argument is a folder name */
"Err4(Folder).f" = "A pasta “%@” não existe.";

/* NSFileNoSuchFileError, argument is a file name */
"Err4(Remove).f" = "Não foi possível remover “%@”.";

/* NSFileNoSuchFileError */
"Err4-C" = "O ficheiro não existe.";

/* NSFileNoSuchFileError, applied to a folder */
"Err4-C(Folder)" = "A pasta não existe.";

/* NSFileNoSuchFileError, argument is a file name */
"Err4.f" = "O ficheiro “%@” não existe.";

/* NSFileWriteUnknownError */
"Err512" = "Não foi possível guardar o ficheiro.";

/* NSFileWriteUnknownError, when the save of the specified file fails because the backup file for the saved file can't be created or updated */
"Err512(Backup).f" = "Não foi possível guardar o ficheiro “%1$@”, porque o ficheiro de cópia de segurança não foi actualizado.";

/* NSFileWriteUnknownError, first argument is the source, second argument is the destination */
"Err512(Copy).fp" = "Não foi possível copiar “%1$@” para “%2$@”.";

/* NSFileWriteUnknownError, first arg: source, second arg: destination */
"Err512(Link).fp" = "Não foi possível ligar “%1$@” a “%2$@”.";

/* NSFileWriteUnknownError, first arg: source file, second arg: destination file */
"Err512(Move).fp" = "Não foi possível mover “%1$@” para “%2$@”.";

/* NSFileWriteUnknownError, argument is a file name */
"Err512(Remove).f" = "Não foi possível remover “%@”.";

/* NSFileWriteUnknownError, when the save of a file fails because the backup file can't be created or updated */
"Err512-C(Backup)" = "Não foi possível guardar o ficheiro de cópia de segurança.";

/* NSFileWriteUnknownError, recovery suggestion for when the save of a file fails because the backup file can't be created or updated */
"Err512-R(Backup)" = "O ficheiro de cópia de segurança pode estar protegido, ou pode não ter autorização para o guardar. Para ver ou alterar as permissões, seleccione o elemento no Finder e seleccione Ficheiro > Informações.";

/* NSFileWriteUnknownError, arguments are folder name where the file was going to be saved, and file name */
"Err512.df" = "Não foi possível guardar o ficheiro “%2$@” na pasta “%1$@”.";

/* NSFileWriteUnknownError, argument is a file name */
"Err512.f" = "Não foi possível guardar o ficheiro “%@”.";

/* NSFileWriteNoPermissionError */
"Err513" = "Não foi possível guardar o ficheiro, porque não tem autorização.";

/* NSFileWriteNoPermissionError, first argument is the source, second argument is the destination */
"Err513(Copy).fp" = "Não foi possível copiar “%1$@”, porque não tem autorização para aceder a “%2$@”.";

/* NSFileWriteNoPermissionError, first arg: source, second arg: destination */
"Err513(Link).fp" = "Não foi possível ligar “%1$@”, porque não tem autorização para aceder a “%2$@”.";

/* NSFileWriteNoPermissionError, first arg: source file, second arg: destination file */
"Err513(Move).fp" = "Não foi possível mover “%1$@”, porque não tem autorização para aceder a “%2$@”.";

/* NSFileWriteNoPermissionError, argument is a file name */
"Err513(Remove).f" = "Não foi possível remover “%@”, porque não tem autorização de acesso.";

/* NSFileWriteNoPermissionError */
"Err513-C" = "Não tem permissão.";

/* NSFileWriteNoPermissionError; suggestion applies to files or folders, hence the use of the word item */
"Err513-R" = "Para ver ou alterar permissões, seleccione o elemento no Finder e escolha Ficheiro > Informações.";

/* NSFileWriteNoPermissionError, arguments are folder name where the file was going to be saved, and file name */
"Err513.df" = "Não tem permissão para guardar o ficheiro “%2$@” na pasta “%1$@”.";

/* NSFileWriteNoPermissionError, argument is a file name */
"Err513.f" = "Não tem permissão para guardar o ficheiro “%@”.";

/* NSFileWriteInvalidFileNameError */
"Err514" = "Não foi possível guardar o elemento, porque o nome de ficheiro não é válido.";

/* NSFileWriteInvalidFileNameError, argument is a file name */
"Err514(Remove).f" = "Não foi possível remover o elemento, porque o nome de ficheiro “%@” não é válido.";

/* NSFileWriteInvalidFileNameError */
"Err514-C" = "O nome de ficheiro não é válido.";

/* NSFileWriteInvalidFileNameError, argument is a file or folder name */
"Err514.f" = "Não foi possível guardar o elemento, porque o nome de ficheiro “%@” não é válido.";

/* NSFileWriteInapplicableStringEncodingError */
"Err517" = "Não foi possível guardar o ficheiro com a codificação de texto especificada.";

/* NSFileWriteInapplicableStringEncodingError */
"Err517-C" = "A codificação de texto especificada não é aplicável.";

/* NSFileWriteInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err517-C.e" = "A codificação de texto %@ não é aplicável.";

/* NSFileWriteInapplicableStringEncodingError */
"Err517-R" = "Seleccione, se possível, outra codificação de texto.";

/* NSFileWriteInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err517.e" = "Não foi possível guardar o ficheiro com a codificação de texto %@.";

/* NSFileWriteInapplicableStringEncodingError, arguments are file name and text encoding name (for instance 'Western (Mac OS Roman)' */
"Err517.ef" = "Não foi possível guardar o ficheiro “%2$@” com a codificação de texto %1$@.";

/* NSFileWriteUnsupportedSchemeError */
"Err518" = "Não foi possível guardar o ficheiro, porque o tipo de URL especificado não é suportado.";

/* NSFileWriteUnsupportedSchemeError */
"Err518-C" = "O tipo de URL especificado não é suportado.";

/* NSFileWriteUnsupportedSchemeError, arguments are file name and URL scheme name (for instance ftp:) */
"Err518.fu" = "Não foi possível guardar o ficheiro “%1$@”, porque o tipo de URL %2$@ não é suportado.";

/* NSFileWriteUnsupportedSchemeError, argument is URL scheme name (for instance ftp:) */
"Err518.u" = "Não foi possível guardar o ficheiro, porque o tipo de URL %@ não é suportado.";

/* NSFileWriteOutOfSpaceError */
"Err640" = "Não foi possível guardar o ficheiro, porque não há espaço suficiente.";

/* NSFileWriteOutOfSpaceError, first arg: source, second arg: destination */
"Err640(Copy).fp" = "Não foi possível copiar “%1$@” para “%2$@” por não haver espaço suficiente.";

/* NSFileWriteOutOfSpaceError, first arg: source, second arg: destination */
"Err640(Link).fp" = "Não foi possível ligar “%1$@” a “%2$@” por não haver espaço suficiente.";

/* NSFileWriteOutOfSpaceError, first arg: source, second arg: destination */
"Err640(Move).fp" = "Não foi possível mover “%1$@” para “%2$@” por não haver espaço suficiente.";

/* NSFileWriteOutOfSpaceError */
"Err640-C" = "Não existe espaço suficiente.";

/* NSFileWriteOutOfSpaceError, argument is volume name */
"Err640-C.v" = "O volume “%@” está cheio.";

/* NSFileWriteOutOfSpaceError */
"Err640-R" = "Elimine alguns ficheiros do volume e volte a tentar.";

/* NSFileWriteOutOfSpaceError, argument is a file name */
"Err640.f" = "Não é possível guardar o ficheiro “%@”, porque não há espaço suficiente.";

/* NSFileWriteOutOfSpaceError, arguments are file name and volume name */
"Err640.fv" = "Não é possível guardar o ficheiro “%1$@”, porque o volume “%2$@” está cheio.";

/* NSFileWriteVolumeReadOnlyError */
"Err642" = "Não foi possível guardar o ficheiro, porque o volume é apenas de leitura.";

/* NSFileWriteVolumeReadOnlyError */
"Err642-C" = "O volume é apenas de leitura.";

/* NSFileWriteVolumeReadOnlyError, argument is volume name */
"Err642-C.v" = "O volume “%@” é apenas de leitura.";

/* NSFileWriteVolumeReadOnlyError */
"Err642-R" = "Experimente guardar o ficheiro noutro volume.";

/* NSFileWriteVolumeReadOnlyError, argument is a file name */
"Err642.f" = "Não é possível guardar o ficheiro “%@”, porque o volume é apenas de leitura.";

/* NSFileWriteVolumeReadOnlyError, arguments are file name and volume name */
"Err642.fv" = "Não é possível guardar o ficheiro “%1$@”, porque o volume “%2$@” é apenas de leitura.";

/* A fallback error message. %@ is the error domain name, %ld is the error number */
"The operation couldn\\U2019t be completed. (%1$@ error %2$ld.)" = "Não foi possível concluir a operação. (%1$@, erro %2$ld.)";

